13/data/attachments/8b2904ea7559f15d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_65a9c040-f806-42c8-b1ad-1b8f9b0c4868</nif:username>
            <nif:friendToBeAdded>Michael_should_Actions_62575_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>